axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2019 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "ESP32CommandStation.h"

#include <ESPAsyncDNSServer.h>
#include <AsyncJson.h>

// generated web content
#include "generated/index_html.h"
#include "generated/jquery_min_js.h"
#include "generated/jquery_mobile_js.h"
#include "generated/jquery_mobile_css.h"
#include "generated/jquery_simple_websocket.h"
#include "generated/jq_clock.h"
#include "generated/ajax_loader.h"

AsyncWebServer webServer(80);
AsyncDNSServer asyncDNS;
AsyncWebSocket webSocket("/ws");

enum HTTP_STATUS_CODES
{
  STATUS_OK = 200
, STATUS_NOT_MODIFIED = 304
, STATUS_BAD_REQUEST = 400
, STATUS_NOT_FOUND = 404
, STATUS_NOT_ALLOWED = 405
, STATUS_NOT_ACCEPTABLE = 406
, STATUS_CONFLICT = 409
, STATUS_PRECONDITION_FAILED = 412
, STATUS_SERVER_ERROR = 500
};

Atomic webSocketAtomic;
vector<WebSocketClient *> webSocketClients;

void handleWsEvent(AsyncWebSocket * server,
                   AsyncWebSocketClient * client,
                   AwsEventType type,
                   void * arg,
                   uint8_t *data,
                   size_t len)
{
  AtomicHolder h(&webSocketAtomic);
  if (type == WS_EVT_CONNECT)
  {
    webSocketClients.push_back(new WebSocketClient(client->id(), ntohl(client->remoteIP())));
    client->printf("<iDCC++ ESP32 Command Station: V-%s / %s %s>", ESP32CS_VERSION, __DATE__, __TIME__);
    infoScreen->replaceLine(INFO_SCREEN_CLIENTS_LINE, 
                            "TCP Conn: %02d",
                            webSocketClients.size() + jmriClients.size());
  }
  else if (type == WS_EVT_DISCONNECT)
  {
    auto elem = std::find_if(webSocketClients.begin(), webSocketClients.end(),
      [client](WebSocketClient *clientNode) -> bool
      {
        return (clientNode->getID() == client->id());
      }
    );
    if (elem != webSocketClients.end())
    {
      delete *elem;
      webSocketClients.erase(elem);
    }
    infoScreen->replaceLine(INFO_SCREEN_CLIENTS_LINE,
                            "TCP Conn: %02d",
                            webSocketClients.size() + jmriClients.size());
  }
  else if (type == WS_EVT_DATA)
  {
    for (auto clientNode : webSocketClients)
    {
      if (clientNode->getID() == client->id())
      {
        clientNode->feed(data, len);
      }
    }
  }
}

ESP32CSWebServer::ESP32CSWebServer(MDNS *mdns) : mdns_(mdns)
{
}

#define BUILTIN_URI(uri) \
  webServer.on(uri \
             , HTTP_GET \
             , std::bind(&ESP32CSWebServer::streamResource, this, std::placeholders::_1));

#define GET_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET \
             , std::bind(&ESP32CSWebServer::method, this, std::placeholders::_1));

#define GET_POST_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET | HTTP_POST \
             , std::bind(&ESP32CSWebServer::method, this, std::placeholders::_1));

#define GET_PUT_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET | HTTP_PUT \
             , std::bind(&ESP32CSWebServer::method, this, std::placeholders::_1));

#define GET_POST_DELETE_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET | HTTP_POST | HTTP_DELETE \
             , std::bind(&ESP32CSWebServer::method, this, std::placeholders::_1));

#define GET_POST_PUT_DELETE_URI(uri, method) \
  webServer.on(uri \
             , HTTP_GET | HTTP_POST | HTTP_PUT | HTTP_DELETE \
             , std::bind(&ESP32CSWebServer::method, this, std::placeholders::_1));

#define POST_UPLOAD_URI(uri, method, callback) \
  webServer.on(uri \
             , HTTP_POST \
             , std::bind(&ESP32CSWebServer::method, this, std::placeholders::_1) \
             , callback);

esp_ota_handle_t otaHandle;
void otaUploadCallback(AsyncWebServerRequest *request
                     , const String& filename
                     , size_t index
                     , uint8_t *data
                     , size_t len
                     , bool final)
{
  esp_err_t res = ESP_OK;
  if (!index)
  {
    request->_tempObject = (void *)esp_ota_get_next_update_partition(NULL);
    res = esp_ota_begin((esp_partition_t *)request->_tempObject
                      , OTA_SIZE_UNKNOWN
                      , &otaHandle);
    if (res != ESP_OK)
    {
      goto ota_failure;
    }
    LOG(INFO, "[WebSrv] OTA Update starting...");
    trackSignal->disable_ops_output();
    trackSignal->disable_prog_output();
    otaMonitor->report_start();
  }
  res = esp_ota_write(otaHandle, data, len);
  if (res != ESP_OK)
  {
    goto ota_failure;
  }
  otaMonitor->report_progress(len);
  if (final)
  {
    res = esp_ota_end(otaHandle);
    if (res != ESP_OK)
    {
      goto ota_failure;
    }
    LOG(INFO, "[WebSrv] OTA binary received, setting boot partition");
    res = esp_ota_set_boot_partition((esp_partition_t *)request->_tempObject);
    if (res != ESP_OK)
    {
      goto ota_failure;
    }
    request->_tempObject = nullptr;
    LOG(INFO, "[WebSrv] OTA Update Complete!");
    otaMonitor->report_success();
  }
  return;

ota_failure:
  request->_tempObject = nullptr;
  LOG_ERROR("[WebSrv] OTA Update failure: %s (%d)", esp_err_to_name(res), res);
  request->send(STATUS_BAD_REQUEST, "text/plain", esp_err_to_name(res));
  otaMonitor->report_failure(res);
}

void ESP32CSWebServer::begin()
{
  if (configStore->isAPEnabled())
  {
    LOG(INFO, "[WebSrv] SoftAP mode enabled, starting DNS server");
    tcpip_adapter_ip_info_t ip_info;
    tcpip_adapter_get_ip_info(TCPIP_ADAPTER_IF_AP, &ip_info);
    // store the IP address for use in the 404 handler
    softAPAddress_ = StringPrintf(IPSTR, IP2STR(&ip_info.ip));
    // start the async dns on the softap address
    asyncDNS.start(53, "*", ip_info.ip);
  }

