axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
  BUILTIN_URI("/jquery.min.js")
  BUILTIN_URI("/jquery.mobile-1.5.0-rc1.min.js")
  BUILTIN_URI("/jquery.mobile-1.5.0-rc1.min.css")
  BUILTIN_URI("/jquery.simple.websocket.min.js")
  BUILTIN_URI("/jqClock-lite.min.js")
  BUILTIN_URI("/images/ajax-loader.gif")
  BUILTIN_URI("/index.html")

  GET_URI("/features", handleFeatures)
  GET_POST_URI("/programmer", handleProgrammer)
  GET_PUT_URI("/power", handlePower)
  GET_POST_DELETE_URI("/config", handleConfig)
  GET_POST_PUT_DELETE_URI("/locomotive", handleLocomotive)
  POST_UPLOAD_URI("/update", handleOTA, otaUploadCallback)

#if ENABLE_OUTPUTS
  GET_POST_PUT_DELETE_URI("/outputs", handleOutputs)
#endif
#if ENABLE_SENSORS
  GET_POST_DELETE_URI("/sensors", handleSensors)
  GET_POST_DELETE_URI("/remoteSensors", handleRemoteSensors)
#if S88_ENABLED
  GET_POST_DELETE_URI("/s88sensors", handleS88Sensors)
#endif
#endif

  webServer.rewrite("/", "/index.html");
  webServer.onNotFound(std::bind(&ESP32CSWebServer::notFoundHandler
                               , this
                               , std::placeholders::_1));

  webSocket.onEvent(handleWsEvent);
  webServer.addHandler(&webSocket);
  webServer.begin();
  mdns_->publish("websvr", "_http._tcp", 80);
}

void ESP32CSWebServer::broadcastToWS(const std::string &buf) {
  webSocket.textAll(buf.c_str());
}

void ESP32CSWebServer::handleProgrammer(AsyncWebServerRequest *request)
{
  auto jsonResponse = new AsyncJsonResponse();
  if (request->method() == HTTP_GET)
  {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE))
    {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
    else if(request->hasArg(JSON_IDENTIFY_NODE))
    {
      JsonObject node = jsonResponse->getRoot();
      int16_t decoderConfig = readCV(CV_NAMES::DECODER_CONFIG);
      uint16_t decoderAddress = 0;
      if (decoderConfig > 0)
      {
        if (bitRead(decoderConfig, DECODER_CONFIG_BITS::DECODER_TYPE))
        {
          uint8_t decoderManufacturer = readCV(CV_NAMES::DECODER_MANUFACTURER);
          int16_t addrMSB = readCV(CV_NAMES::ACCESSORY_DECODER_MSB_ADDRESS);
          int16_t addrLSB = readCV(CV_NAMES::SHORT_ADDRESS);
          if (addrMSB >= 0 && addrLSB >= 0)
          {
            if (decoderManufacturer == 0xA5)
            {
              // MERG uses 7 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 7) | (addrLSB & 0x7F));
            }
            else if(decoderManufacturer == 0x19)
            {
              // Team Digital uses 8 bit LSB and 4 bit MSB
              decoderAddress = (uint16_t)(((addrMSB & 0x0F) << 8) | addrLSB);
            }
            else
            {
              // NMRA spec shows 6 bit LSB
              decoderAddress = (uint16_t)(((addrMSB & 0x07) << 6) | (addrLSB & 0x1F));
            }
            node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_LONG_ADDRESS;
          }
          else
          {
            LOG(WARNING, "Failed to read address MSB/LSB");
            jsonResponse->setCode(STATUS_SERVER_ERROR);
          }
        }
        else
        {
          if (bitRead(decoderConfig, DECODER_CONFIG_BITS::SHORT_OR_LONG_ADDRESS))
          {
            int16_t addrMSB = readCV(CV_NAMES::LONG_ADDRESS_MSB_ADDRESS);
            int16_t addrLSB = readCV(CV_NAMES::LONG_ADDRESS_LSB_ADDRESS);
            if (addrMSB >= 0 && addrLSB >= 0)
            {
              decoderAddress = (uint16_t)(((addrMSB & 0xFF) << 8) | (addrLSB & 0xFF));
              node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_LONG_ADDRESS;
            }
            else
            {
              LOG(WARNING, "Unable to read address MSB/LSB");
              jsonResponse->setCode(STATUS_SERVER_ERROR);
            }
          }
          else
          {
            int16_t shortAddr = readCV(CV_NAMES::SHORT_ADDRESS);
            if (shortAddr > 0)
            {
              decoderAddress = shortAddr;
              node[JSON_ADDRESS_MODE_NODE] = JSON_VALUE_SHORT_ADDRESS;
            }
            else
            {
              LOG(WARNING, "Unable to read short address CV");
              jsonResponse->setCode(STATUS_SERVER_ERROR);
            }
          }
          if (bitRead(decoderConfig, DECODER_CONFIG_BITS::SPEED_TABLE))
          {
            node[JSON_SPEED_TABLE_NODE] = JSON_VALUE_ON;
          }
          else
          {
            node[JSON_SPEED_TABLE_NODE] = JSON_VALUE_OFF;
          }
        }
        if (decoderAddress > 0)
        {
          node[JSON_ADDRESS_NODE] = decoderAddress;
          auto roster = locoManager->getRosterEntry(decoderAddress, false);
          if (roster)
          {
            node[JSON_LOCO_NODE] = roster;
          }
          else if(request->hasArg(JSON_CREATE_NODE) && request->arg(JSON_CREATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE))
          {
            roster = locoManager->getRosterEntry(decoderAddress);
            if (decoderConfig > 0)
            {
              if (bitRead(decoderConfig, DECODER_CONFIG_BITS::DECODER_TYPE))
              {
                roster->setType(JSON_VALUE_STATIONARY_DECODER);
              }
              else
              {
                roster->setType(JSON_VALUE_MOBILE_DECODER);
              }
            }
            node[JSON_LOCO_NODE] = roster;
          }
        }
        else
        {
          LOG(WARNING, "Failed to read decoder address");
          jsonResponse->setCode(STATUS_SERVER_ERROR);
        }
      }
      else
      {
        LOG(WARNING, "Failed to read decoder configuration");
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
    }
    else
    {
      uint16_t cvNumber = request->arg(JSON_CV_NODE).toInt();
      int16_t cvValue = readCV(cvNumber);
      JsonObject node = jsonResponse->getRoot();
      node[JSON_CV_NODE] = cvNumber;
      node[JSON_VALUE_NODE] = cvValue;
      if (cvValue < 0)
      {
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
      else
      {
        jsonResponse->setCode(STATUS_OK);
      }
    }
  }
  else if (request->method() == HTTP_POST && request->hasArg(JSON_PROG_ON_MAIN))
  {
    if (request->arg(JSON_PROG_ON_MAIN).equalsIgnoreCase(JSON_VALUE_TRUE))
    {
      if (request->hasArg(JSON_CV_BIT_NODE))
      {
        writeOpsCVBit(request->arg(JSON_ADDRESS_NODE).toInt(), request->arg(JSON_CV_NODE).toInt(),
          request->arg(JSON_CV_BIT_NODE).toInt(), request->arg(JSON_VALUE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
      }
      else
      {
        writeOpsCVByte(request->arg(JSON_ADDRESS_NODE).toInt(), request->arg(JSON_CV_NODE).toInt(),
          request->arg(JSON_VALUE_NODE).toInt());
      }
      jsonResponse->setCode(STATUS_OK);
    }
    else
    {
      bool writeSuccess = false;
      if (request->hasArg(JSON_CV_BIT_NODE))
      {
        writeSuccess = writeProgCVBit(request->arg(JSON_CV_NODE).toInt(), request->arg(JSON_CV_BIT_NODE).toInt(),
          request->arg(JSON_VALUE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
      }
      else
      {
        writeSuccess = writeProgCVByte(request->arg(JSON_CV_NODE).toInt(), request->arg(JSON_VALUE_NODE).toInt());
      }
      if (writeSuccess)
      {
        jsonResponse->setCode(STATUS_OK);
      }
      else
      {
        jsonResponse->setCode(STATUS_SERVER_ERROR);
      }
    }
  }
  else
  {
    jsonResponse->setCode(STATUS_BAD_REQUEST);
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
 }

void ESP32CSWebServer::handlePower(AsyncWebServerRequest *request)
{
  if (request->method() == HTTP_GET)
  {
    AsyncJsonResponse *jsonResponse = nullptr;
    if (request->params())
    {
      jsonResponse = new AsyncJsonResponse();
      jsonResponse->getRoot()[JSON_STATE_NODE] =
        trackSignal->is_enabled() ? JSON_VALUE_TRUE : JSON_VALUE_FALSE;
    }
    else
    {
      jsonResponse = new AsyncJsonResponse(true);
      trackSignal->generate_status_json(jsonResponse->getRoot());
    }
    jsonResponse->setLength();
    request->send(jsonResponse);
    return;
  }
  else if (request->method() == HTTP_PUT && request->hasArg(JSON_STATE_NODE))
  {
    if (request->arg(JSON_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE))
    {
      trackSignal->enable_ops_output();
    }
    else
    {
      trackSignal->disable_ops_output();
      trackSignal->disable_prog_output();
    }
    request->send(STATUS_OK);
    return;
  }
  request->send(STATUS_BAD_REQUEST);
 }

void ESP32CSWebServer::handleOutputs(AsyncWebServerRequest *request)
{
#if ENABLE_OUTPUTS
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params());
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE))
  {
    JsonArray array = jsonResponse->getRoot();
    OutputManager::getState(array);
  }
  else if (request->method() == HTTP_GET)
  {
    auto output = OutputManager::getOutput(request->arg(JSON_ID_NODE).toInt());
    if (output)
    {
      output->toJson(jsonResponse->getRoot(), true);
    }
    else
    {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  }
  else if (request->method() == HTTP_POST)
  {
    uint16_t outputID = request->arg(JSON_ID_NODE).toInt();
    uint8_t pin = request->arg(JSON_PIN_NODE).toInt();
    bool inverted = request->arg(JSON_INVERTED_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    bool forceState = request->arg(JSON_FORCE_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    bool defaultState = request->arg(JSON_DEFAULT_STATE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    uint8_t outputFlags = 0;
    if (inverted)
    {
      bitSet(outputFlags, OUTPUT_IFLAG_INVERT);
    }
    if (forceState)
    {
      bitSet(outputFlags, OUTPUT_IFLAG_RESTORE_STATE);
      if (defaultState)
      {
        bitSet(outputFlags, OUTPUT_IFLAG_FORCE_STATE);
      }
    }
    if (!OutputManager::createOrUpdate(outputID, pin, outputFlags))
    {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  }
  else if (request->method() == HTTP_DELETE)
  {
    if (!OutputManager::remove(request->arg(JSON_ID_NODE).toInt()))
    {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  }
  else if(request->method() == HTTP_PUT)
  {
   OutputManager::toggle(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
#endif // ENABLE_OUTPUTS
}

void ESP32CSWebServer::handleTurnouts(AsyncWebServerRequest *request)
{
  // GET /turnouts - full list of turnouts, note that turnout state is STRING type for display
  // GET /turnouts?readbleStrings=[0,1] - full list of turnouts, turnout state will be returned as true/false (boolean) when readableStrings=0.
  // GET /turnouts?address=<address> - retrieve turnout by DCC address
  // GET /turnouts?id=<id> - retrieve turnout by ID
  // PUT /turnouts?address=<address> - toggle turnout by DCC address
  // PUT /turnouts?id=<id> - toggle turnout by ID
  // POST /turnouts?id=<id>&address=<address>&subAddress=<subAddress>&type=<type> - creates a new turnout
  //      when id is -1 it will be auto-assigned as number of defined turnouts + 1.
  //      if subAddress is -1 the turnout will be defined as DCC address only.
  // DELETE /turnouts?id=<id> - delete turnout by ID
  // DELETE /turnouts?address=<address> - delete turnout by DCC address
  //
  // For successful requests the result code will be 200 and either an array of turnouts or single turnout will be returned.
  // For unsuccessful requests the result code will be 400 (bad request, missing args), 401 (not found), 500 (server failure).
  //

  // if the request is GET and we do not have an ID or ADDRESS parameter we need to return an array, otherwise a single entity.
  bool needArrayResponse = (
    request->method() == HTTP_GET &&
    !request->hasArg(JSON_ID_NODE) &&
    !request->hasArg(JSON_ADDRESS_NODE));
  auto jsonResponse = new AsyncJsonResponse(needArrayResponse);
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE))
  {
    bool readableStrings = true;
    if (request->hasArg(JSON_TURNOUTS_READABLE_STRINGS_NODE))
    {
      readableStrings = request->arg(JSON_TURNOUTS_READABLE_STRINGS_NODE).toInt();
    }
    JsonArray array = jsonResponse->getRoot();
    turnoutManager->getState(array, readableStrings);
  }
  else if (request->method() == HTTP_GET)
  {
    if(request->hasArg(JSON_ID_NODE))
    {
      auto turnout = turnoutManager->getTurnoutByID(request->arg(JSON_ID_NODE).toInt());
      if (turnout)
      {
        turnout->toJson(jsonResponse->getRoot());
      }
      else
      {
        jsonResponse->setCode(STATUS_NOT_FOUND);
      }
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      auto turnout = turnoutManager->getTurnoutByID(request->arg(JSON_ADDRESS_NODE).toInt());
      if (turnout)
      {
        turnout->toJson(jsonResponse->getRoot());
      }
      else
      {
        jsonResponse->setCode(STATUS_NOT_FOUND);
      }
    }
    else
    {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  else if (request->method() == HTTP_POST)
  {
    int32_t turnoutID = request->arg(JSON_ID_NODE).toInt();
    uint16_t turnoutAddress = request->arg(JSON_ADDRESS_NODE).toInt();
    int8_t turnoutSubAddress = request->arg(JSON_SUB_ADDRESS_NODE).toInt();
    TurnoutType type = (TurnoutType)request->arg(JSON_TYPE_NODE).toInt();
    // auto generate ID
    if (turnoutID == -1)
    {
      turnoutID = turnoutManager->getTurnoutCount() + 1;
    }
    auto turnout = turnoutManager->createOrUpdate((uint16_t)turnoutID, turnoutAddress, turnoutSubAddress, type);
    if (turnout)
    {
      turnout->toJson(jsonResponse->getRoot());
    }
    else
    {
      jsonResponse->setCode(STATUS_SERVER_ERROR);
    }
  }
  else if (request->method() == HTTP_DELETE)
  {
    if (request->hasArg(JSON_ID_NODE))
    {
      turnoutManager->removeByID(request->arg(JSON_ID_NODE).toInt());
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      turnoutManager->removeByAddress(request->arg(JSON_ADDRESS_NODE).toInt());
    }
    else
    {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  else if (request->method() == HTTP_PUT)
  {
    if (request->hasArg(JSON_ID_NODE))
    {
      turnoutManager->toggleByID(request->arg(JSON_ID_NODE).toInt());
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      turnoutManager->toggleByAddress(request->arg(JSON_ADDRESS_NODE).toInt());
    }
    else
    {
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void ESP32CSWebServer::handleSensors(AsyncWebServerRequest *request)
{
#if ENABLE_SENSORS
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params());
  if (request->method() == HTTP_GET && !request->hasArg(JSON_ID_NODE))
  {
    JsonArray array = jsonResponse->getRoot();
    SensorManager::getState(array);
  }
  else if (request->method() == HTTP_GET)
  {
    auto sensor = SensorManager::getSensor(request->arg(JSON_ID_NODE).toInt());
    if(sensor)
    {
      sensor->toJson(jsonResponse->getRoot());
    }
    else
    {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  }
  else if(request->method() == HTTP_POST)
  {
    uint16_t sensorID = request->arg(JSON_ID_NODE).toInt();
    uint8_t sensorPin = request->arg(JSON_PIN_NODE).toInt();
    bool sensorPullUp = request->arg(JSON_PULLUP_NODE).equalsIgnoreCase(JSON_VALUE_TRUE);
    if(!SensorManager::createOrUpdate(sensorID, sensorPin, sensorPullUp)) {
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  }
  else if(request->method() == HTTP_DELETE)
  {
    uint16_t sensorID = request->arg(JSON_ID_NODE).toInt();
    if(SensorManager::getSensorPin(sensorID) < 0)
    {
      // attempt to delete S88/RemoteSensor
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
    else if(!SensorManager::remove(sensorID))
    {
      jsonResponse->setCode(STATUS_NOT_FOUND);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
#endif // ENABLE_SENSORS
}

void ESP32CSWebServer::handleConfig(AsyncWebServerRequest *request)
{
  if (request->method() == HTTP_POST)
  {
    DCCPPProtocolHandler::getCommandHandler("E")->process(vector<string>());
  }
  else if (request->method() == HTTP_DELETE)
  {
    DCCPPProtocolHandler::getCommandHandler("e")->process(vector<string>());
  }
  else if (request->method() != HTTP_GET)
  {
    request->send(STATUS_BAD_REQUEST);
  }
  request->send(STATUS_OK, "application/json", configStore->getCSConfig().c_str());
}

#if S88_ENABLED && ENABLE_SENSORS
void ESP32CSWebServer::handleS88Sensors(AsyncWebServerRequest *request)
{
  auto jsonResponse = new AsyncJsonResponse(true);
  if(request->method() == HTTP_GET) {
    JsonArray &array = jsonResponse->getRoot();
    S88BusManager::getState(array);
  }
  else if(request->method() == HTTP_POST)
  {
    if(!S88BusManager::createOrUpdateBus(
      request->arg(JSON_ID_NODE).toInt(),
      request->arg(JSON_PIN_NODE).toInt(),
      request->arg(JSON_COUNT_NODE).toInt()))
    {
      // duplicate pin/id
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  }
  else if(request->method() == HTTP_DELETE)
  {
    S88BusManager::removeBus(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}
#endif

