axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
void ESP32CSWebServer::handleRemoteSensors(AsyncWebServerRequest *request) {
#if ENABLE_SENSORS
  auto jsonResponse = new AsyncJsonResponse(true);
  if(request->method() == HTTP_GET)
  {
    JsonArray array = jsonResponse->getRoot();
    RemoteSensorManager::getState(array);
  }
  else if(request->method() == HTTP_POST)
  {
    RemoteSensorManager::createOrUpdate(request->arg(JSON_ID_NODE).toInt(),
      request->arg(JSON_VALUE_NODE).toInt());
  }
  else if(request->method() == HTTP_DELETE)
  {
    RemoteSensorManager::remove(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
#endif // ENABLE_SENSORS
}

void ESP32CSWebServer::handleLocomotive(AsyncWebServerRequest *request)
{
  // method - url pattern - meaning
  // ANY /locomotive/estop - send emergency stop to all locomotives
  // GET /locomotive/roster - roster
  // GET /locomotive/roster?address=<address> - get roster entry
  // PUT /locomotive/roster?address=<address> - update roster entry
  // POST /locomotive/roster?address=<address> - create roster entry
  // DELETE /locomotive/roster?address=<address> - delete roster entry
  // GET /locomotive - get active locomotives
  // POST /locomotive?address=<address> - add locomotive to active management
  // GET /locomotive?address=<address> - get locomotive state
  // PUT /locomotive?address=<address>&speed=<speed>&dir=[FWD|REV]&fX=[true|false] - Update locomotive state, fX is short for function X where X is 0-28.
  // DELETE /locomotive?address=<address> - removes locomotive from active management
  const String url = request->url();
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params(), 2048);
  jsonResponse->setCode(STATUS_OK);
  // check if we have an eStop command, we don't care how this gets sent to the
  // command station (method) so check it first
  if(url.endsWith("/estop"))
  {
    locoManager->set_state(true);
  }
  else if(url.indexOf("/roster") > 0)
  {
    if(request->method() == HTTP_GET && !request->hasArg(JSON_ADDRESS_NODE))
    {
      locoManager->getRosterEntries(jsonResponse->getRoot());
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      if(request->method() == HTTP_DELETE)
      {
        locoManager->removeRosterEntry(request->arg(JSON_ADDRESS_NODE).toInt());
      }
      else
      {
        RosterEntry *entry = locoManager->getRosterEntry(request->arg(JSON_ADDRESS_NODE).toInt());
        if(request->method() == HTTP_PUT || request->method() == HTTP_POST)
        {
          if(request->hasArg(JSON_DESCRIPTION_NODE))
          {
            entry->setDescription(request->arg(JSON_DESCRIPTION_NODE).c_str());
          }
          if(request->hasArg(JSON_TYPE_NODE))
          {
            entry->setType(request->arg(JSON_TYPE_NODE).c_str());
          }
          if(request->hasArg(JSON_IDLE_ON_STARTUP_NODE))
          {
            entry->setIdleOnStartup(request->arg(JSON_IDLE_ON_STARTUP_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
          if(request->hasArg(JSON_DEFAULT_ON_THROTTLE_NODE))
          {
            entry->setDefaultOnThrottles(request->arg(JSON_DEFAULT_ON_THROTTLE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
        }
        entry->toJson(jsonResponse->getRoot());
      }
    }
  }
  else
  {
    // Since it is not an eStop or roster command we need to check the request
    // method and ensure it contains the required arguments otherwise the
    // request should be rejected
    if(request->method() == HTTP_GET && !request->hasArg(JSON_ADDRESS_NODE))
    {
      // get all active locomotives
      locoManager->getActiveLocos(jsonResponse->getRoot()); 
    }
    else if (request->hasArg(JSON_ADDRESS_NODE))
    {
      auto loco = locoManager->getLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
      if(request->method() == HTTP_PUT || request->method() == HTTP_POST)
      {
        auto upd_speed = loco->get_speed();
        // Creation / Update of active locomotive
        if(request->hasArg(JSON_IDLE_NODE) && request->arg(JSON_IDLE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE))
        {
          upd_speed.set_dcc_128(0);
        }
        if(request->hasArg(JSON_SPEED_NODE))
        {
          upd_speed.set_dcc_128(request->arg(JSON_SPEED_NODE).toInt());
        }
        if(request->hasArg(JSON_DIRECTION_NODE))
        {
          upd_speed.set_direction(request->arg(JSON_DIRECTION_NODE).equalsIgnoreCase(JSON_VALUE_FORWARD) ? dcc::SpeedType::FORWARD : dcc::SpeedType::REVERSE);
        }
        loco->set_speed(upd_speed);
        for(uint8_t funcID = 0; funcID <=28 ; funcID++)
        {
          String fArg = "f" + String(funcID);
          if(request->hasArg(fArg.c_str()))
          {
            loco->set_fn(funcID, request->arg(fArg.c_str()).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
        }
      }
      else if(request->method() == HTTP_DELETE)
      {
        // Removal of an active locomotive
        locoManager->removeLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
#if NEXTION_ENABLED
        static_cast<NextionThrottlePage *>(nextionPages[THROTTLE_PAGE])->invalidateLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
#endif
      }
      loco->toJson(jsonResponse->getRoot());
    }
    else
    {
      // missing arg or unknown request
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void ESP32CSWebServer::handleOTA(AsyncWebServerRequest *request)
{
  request->send(STATUS_OK, "text/plain", "OTA Upload Complete");
}

void ESP32CSWebServer::handleFeatures(AsyncWebServerRequest *request)
{
  auto jsonResponse = new AsyncJsonResponse();
  JsonObject root = jsonResponse->getRoot();
  root[JSON_S88_SENSOR_BASE_NODE] = S88_FIRST_SENSOR;
  root[JSON_S88_NODE] = S88_ENABLED && ENABLE_SENSORS ? JSON_VALUE_TRUE : JSON_VALUE_FALSE;
  root[JSON_OUTPUTS_NODE] = ENABLE_OUTPUTS ? JSON_VALUE_TRUE : JSON_VALUE_FALSE;
  root[JSON_SENSORS_NODE] = ENABLE_SENSORS ? JSON_VALUE_TRUE : JSON_VALUE_FALSE;
  jsonResponse->setCode(STATUS_OK);
  jsonResponse->setLength();
  request->send(jsonResponse);
}

