axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
#define IP_TO_STR(request) \
  ipv4_to_string(ntohl(request->client()->getRemoteAddress())).c_str()

#define STREAM_RESOURCE_NO_REDIRECT(request, uri, mimeType, totalSize, resource) \
  if (request->url() == uri) { \
    LOG(INFO, "[WebSrv %s] Sending %s from MEMORY (%d, %s)", IP_TO_STR(request), uri, totalSize, mimeType); \
    response = request->beginResponse_P(STATUS_OK, mimeType, resource, totalSize); \
    if(String(mimeType).startsWith("text/")) { \
      response->addHeader("Content-Encoding", "gzip"); \
    } \
  }

#define STREAM_RESOURCE(request, uri, fallback, mimeType, totalSize, resource) \
  if (request->url() == uri && configStore->isAPEnabled() && softAPAddress_.compare(request->host().c_str()) == 0) { \
    LOG(INFO, "[WebSrv %s] Sending %s from MEMORY (%d, %s)", IP_TO_STR(request), uri, totalSize, mimeType); \
    response = request->beginResponse_P(STATUS_OK, mimeType, resource, totalSize); \
    if(String(mimeType).startsWith("text/")) { \
      response->addHeader("Content-Encoding", "gzip"); \
    } \
  } else if (request->url() == uri) { \
    LOG(INFO, "[WebSrv %s] Requested %s => CDN %s", IP_TO_STR(request), uri, fallback); \
    request->redirect(fallback); \
  }

void ESP32CSWebServer::streamResource(AsyncWebServerRequest *request)
{
  const char * htmlBuildTime = __DATE__ " " __TIME__;
  if (request->header("If-Modified-Since").equals(htmlBuildTime))
  {
    request->send(STATUS_NOT_MODIFIED);
  }
  else
  {
    AsyncWebServerResponse *response = nullptr;
    STREAM_RESOURCE_NO_REDIRECT(request, "/index.html", "text/html", indexHtmlGz_size, indexHtmlGz)
    STREAM_RESOURCE(request, "/jquery.min.js", "https://ajax.googleapis.com/ajax/libs/jquery/3.2.1/jquery.min.js", "text/javascript", jqueryJsGz_size, jqueryJsGz)
    STREAM_RESOURCE(request, "/jquery.mobile-1.5.0-rc1.min.js", "https://code.jquery.com/mobile/1.5.0-rc1/jquery.mobile-1.5.0-rc1.min.js", "text/javascript", jqueryMobileJsGz_size, jqueryMobileJsGz)
    STREAM_RESOURCE(request, "/jquery.mobile-1.5.0-rc1.min.css", "https://code.jquery.com/mobile/1.5.0-rc1/jquery.mobile-1.5.0-rc1.min.css", "text/css", jqueryMobileCssGz_size, jqueryMobileCssGz)
    STREAM_RESOURCE(request, "/jquery.simple.websocket.min.js", "https://cdn.rawgit.com/jbloemendal/jquery-simple-websocket/master/dist/jquery.simple.websocket.min.js", "text/javascript", jquerySimpleWebSocketGz_size, jquerySimpleWebSocketGz)
    STREAM_RESOURCE(request, "/jqClock-lite.min.js", "https://cdn.rawgit.com/JohnRDOrazio/jQuery-Clock-Plugin/master/jqClock-lite.min.js", "text/javascript", jqClockGz_size, jqClockGz)
    STREAM_RESOURCE(request, "/images/ajax-loader.gif", "https://code.jquery.com/mobile/1.5.0-rc1/images/ajax-loader.gif", "image/gif", ajaxLoader_size, ajaxLoader)
    if(response)
    {
      response->addHeader("Last-Modified", htmlBuildTime);
      request->send(response);
    }
    else
    {
      request->send(STATUS_NOT_FOUND, "text/plain", "URI Not Found");
    }
  }
}

// Known captive portal checks to respond with http 200 and redirect link
String portalCheckRedirect[] =
{
  "/generate_204",                  // Android
  "/gen_204",                       // Android 9.0
  "/mobile/status.php",             // Android 8.0 (Samsung s9+)
  "/ncsi.txt",                      // Windows
  "/success.txt",                   // OSX
  "/hotspot-detect.html",           // iOS 8/9
  "/hotspotdetect.html",            // iOS 8/9
  "/library/test/success.html"      // iOS 8/9
  "/kindle-wifi/wifiredirect.html"  // Kindle
  "/kindle-wifi/wifistub.html"      // Kindle
};

static constexpr const char * const REDIRECT_HTML =
  "<html>"
  "<title>ESP32 Command Station v%s</title>"                                          // VERSION
  "<meta http-equiv=\"refresh\" content=\"5;url='http://%s/index.html'\" /> "         // softAPAddress_
  "<body>"
  "<h1>Welcome to the ESP32 Command Station</h1>"
  "<p>Click <a href=\"http://%s/index.html\">here</a> for ESP32 Command Station if "  // softAPAddress_
  "you are not automatically redirected in a few seconds.</p>"
  "</body>"
  "</html>";

void ESP32CSWebServer::notFoundHandler(AsyncWebServerRequest *request)
{
  if (configStore->isAPEnabled())
  {
    for(auto uri : portalCheckRedirect)
    {
      if(request->url() == uri)
      {
        LOG(INFO,
            "[WebSrv %s] Requested %s%s: Appears to be a captive portal check, "
            "redirecting to http://%s/index.html",
            IP_TO_STR(request),
            request->host().c_str(),
            request->url().c_str(),
            softAPAddress_.c_str());
        request->send(STATUS_OK,
                      "text/html",
                      StringPrintf(REDIRECT_HTML,
                                  ESP32CS_VERSION,
                                  softAPAddress_.c_str(),
                                  softAPAddress_.c_str()).c_str());
        return;
      }
    }
  }
  LOG(INFO, "[WebSrv %s] 404: %s%s", IP_TO_STR(request)
    , request->host().c_str(), request->url().c_str());
  request->send(STATUS_NOT_FOUND, "", "");
}